dozack/nrf24l01-stm32l4xx/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2022 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "FreeRTOS.h"
#include "task.h"
#include "queue.h"

#include "nrf24l01.h"
#include "nrf24l01_hal_stm32l4xx.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

typedef struct {
    uint8_t size;
    uint8_t data[NRF24L01_MAX_PAYLOAD_SIZE];
}nrf24l01_message_t;

typedef struct {
    uint32_t tx_complete;
    uint32_t tx_lost;
    uint32_t tx_postponed;

    uint32_t rx_complete;
    uint32_t rx_lost;
} nrf24l01_stats_t;

typedef struct nrf24l01_service {
    nrf24l01_t          device;
    nrf24l01_stats_t    stats;

    nrf24l01_message_t  txbuff[16];
    QueueHandle_t       txq;
    StaticQueue_t       txc;

    nrf24l01_message_t  rxbuff[16];
    QueueHandle_t       rxq;
    StaticQueue_t       rxc;
} nrf24l01_service_t;

static nrf24l01_service_t service;

static void nrf24l01_on_event(void *context) {
    BaseType_t          xHigherPriorityTaskWoken = pdFALSE;
    nrf24l01_service_t *svc = (nrf24l01_service_t*) (context);
    nrf24l01_message_t  message;
    uint8_t             status;

    /* Set device to standby mode to disable its clock */
    nrf24l01_standby(&svc->device);
    /* Read and clear status register */
    status = nrf24l01_clear_status(&svc->device);
    /* Start listening in order to acquire channel activity measurement */
    nrf24l01_listen(&svc->device);

    if (status & NRF24L01_STATUS_RX_DR) {
        /* Read all pending messages */
        while (nrf24l01_rx_pending(&svc->device) > 0) {
            /* Fetch message from device */
            nrf24l01_read(&svc->device, &message.data[0], &message.size);
            if (xQueueSendFromISR(svc->rxq, &message, &xHigherPriorityTaskWoken) != pdFALSE) {
                /* Reception complete */
                svc->stats.rx_complete++;
            } else {
                /* Queue is full, message is lost */
                svc->stats.rx_lost++;
            }
        }
    }
    if (status & NRF24L01_STATUS_MAX_RT) {
        /* Flush devices tx fifo in order to release failed transmission */
        nrf24l01_flush_tx(&svc->device);
        svc->stats.tx_lost++;
    }
    if (status & NRF24L01_STATUS_TX_DS) {
        /* Transmission complete */
        svc->stats.tx_complete++;
    }
    if (uxQueueMessagesWaitingFromISR(svc->txq) > 0) {
        /* Outgoing messages available, check channel availability */
        if (nrf24l01_channel_available(&svc->device)) {
            /* Fetch outgoing message from queue and transmit */
            xQueueReceiveFromISR(svc->txq, &message, &xHigherPriorityTaskWoken);
            nrf24l01_write(&svc->device, &message.data[0], message.size);
        } else {
            /* Channel is not available, postpone transmission */
            svc->stats.tx_postponed++;
        }
    }

    portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
}

static int nrf24l01_service_send(struct nrf24l01_service *svc, nrf24l01_message_t *message) {

    if (xQueueSend(svc->txq, message, 0) == pdTRUE) {
        nrf24l01_trigger_irq(&svc->device);
        return (0);
    }

    return (-1);
}

static int nrf24l01_service_recv(struct nrf24l01_service *svc, nrf24l01_message_t *message) {

    if (xQueueReceive(svc->rxq, message, 0) == pdTRUE) {
        return (0);
    }

    return (-1);
}

static nrf24l01_message_t g_txmessage;
static nrf24l01_message_t g_rxmessage;

static void nrf24l01_task_handler(void *context) {
    struct nrf24l01_service *svc = (struct nrf24l01_service*) (context);

    TickType_t t_act, t_last = 0;

    svc->stats = (nrf24l01_stats_t ) { 0 };

    svc->txq = xQueueCreateStatic(16, sizeof(nrf24l01_message_t), (uint8_t* ) &svc->txbuff[0], &svc->txc);
    svc->rxq = xQueueCreateStatic(16, sizeof(nrf24l01_message_t), (uint8_t* ) &svc->rxbuff[0], &svc->rxc);

    nrf24l01_notify(&svc->device, &nrf24l01_on_event, svc);
    nrf24l01_open(&svc->device);
    nrf24l01_listen(&svc->device);

    vTaskDelay(1);

    g_txmessage.size = NRF24L01_MAX_PAYLOAD_SIZE;
    g_txmessage.data[0] = 0;

    for (;;) {

        t_act = xTaskGetTickCount();

        nrf24l01_service_recv(svc, &g_rxmessage);

        if ((t_act - t_last) > 50) {
            if (nrf24l01_service_send(svc, &g_txmessage) >= 0) {
                g_txmessage.data[0]++;
                t_last = t_act;
            }
        }

        vTaskDelay(1);
    }
}

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */
  traceSTART();
  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  /* USER CODE BEGIN 2 */

    nrf24l01_config_t config = { .address = 0xcecececece, .channel = 110, .retr_count = 3, .retr_delay = 250 };

    nrf24l01_hal_attach(&service.device, &nrf24l01_hal_stm32l4xx);
    nrf24l01_initialize(&service.device);
    nrf24l01_configure(&service.device, &config);

    if (nrf24l01_probe(&service.device) < 0) {
        HAL_NVIC_SystemReset();
    }

    static StackType_t ITS[configMINIMAL_STACK_SIZE];
    static StaticTask_t ITC;

    xTaskCreateStatic(&nrf24l01_task_handler, "NRF24", configMINIMAL_STACK_SIZE, &service, 6, ITS, &ITC);
    vTaskStartScheduler();


  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
    while (1)
    {
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
    }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage
  */
  if (HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE1) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
  RCC_OscInitStruct.PLL.PLLM = 4;
  RCC_OscInitStruct.PLL.PLLN = 40;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV7;
  RCC_OscInitStruct.PLL.PLLQ = RCC_PLLQ_DIV2;
  RCC_OscInitStruct.PLL.PLLR = RCC_PLLR_DIV2;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_4) != HAL_OK)
  {
    Error_Handler();
  }
}

/* USER CODE BEGIN 4 */

void vApplicationGetIdleTaskMemory(StaticTask_t **ppxIdleTaskTCBBuffer, StackType_t **ppxIdleTaskStackBuffer,
        uint32_t *pulIdleTaskStackSize) {

    static StaticTask_t IdleTaskControl;
    static StackType_t IdleTaskStack[configMINIMAL_STACK_SIZE];

    *ppxIdleTaskTCBBuffer = &IdleTaskControl;
    *ppxIdleTaskStackBuffer = &IdleTaskStack[0];
    *pulIdleTaskStackSize = configMINIMAL_STACK_SIZE;
}

#if (configUSE_TIMERS == 1)
void vApplicationGetTimerTaskMemory(StaticTask_t **ppxTimerTaskTCBBuffer, StackType_t **ppxTimerTaskStackBuffer,
        uint32_t *pulTimerTaskStackSize) {

    static StaticTask_t TimerTaskControl;
    static StackType_t TimerTaskStack[configTIMER_TASK_STACK_DEPTH];

    *ppxTimerTaskTCBBuffer = &TimerTaskControl;
    *ppxTimerTaskStackBuffer = &TimerTaskStack[0];
    *pulTimerTaskStackSize = configTIMER_TASK_STACK_DEPTH;
}
#endif

void vApplicationIdleHook(void) {
}

void vApplicationTickHook(void) {
}

/* USER CODE END 4 */

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM6 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM6) {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */

  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
    /* User can add his own implementation to report the HAL error return state */
    __disable_irq();
    while (1)
    {
    }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
